vault/raw/2026-08-29_pilot_k6_load_sizing_rehearsal.txt
k6 부하 수준 결정을 위한 사전 측정 — 2026-08-29, 리허설(한 대)
조건: PostgreSQL 16 (cpus:2, mem 2g), user_rating 5,030,000
     앱: Spring Boot 3.5.5, 호스트에서 java -jar, HikariCP 기본 풀 10
     인덱스: idx_user_rating__movie_rating, idx_user_rating__user_updated (베이스라인)
     직전 커밋: b1a92d5

⚠ 한 대에서 k6와 앱이 CPU를 나눠 쓰므로 절대값은 믿지 않는다.
  같은 세션, 같은 기계에서의 상대 비교만 유효하다(lab/README.md "부하 생성기 위치").

================================================================
1. 엔드포인트별 단건 비용 (유휴 상태, curl 3~5회 평균)
================================================================

$ curl -o /dev/null -w "%{time_total}"

/lab/ratings?offset=50000&limit=10          0.8216 s
/lab/ratings?offset=200000&limit=10         0.7381 s
/lab/ratings?offset=500000&limit=10         0.7495 s
/lab/ratings?offset=1000000&limit=10        0.7889 s
/lab/ratings?offset=4900000&limit=10        1.1647 s
/lab/movies/60300/stats                     0.0062 s
/lab/movies/16710/stats                     0.0129 s
/lab/ratings?userId=36&offset=4000&limit=10 0.0063 s

관찰: offset 50,000 ~ 1,000,000 이 전부 0.74~0.82초로 비슷하다.
비용의 대부분이 오프셋 건너뛰기가 아니라 5,030,000행 정렬이다
(updated_at 인덱스가 없어서 top-N sort).

--- 오염된 측정 (기록만 남김) ---
같은 측정을 k6를 kill한 직후에 돌렸더니 33.28 / 30.02 / 10.46 / 0.83 초가 나왔다.
DB에 이전 부하가 남아 있었다. pg_stat_activity의 active가 0인지,
dockerstats_cpu_usage_ratio가 내려왔는지 확인하고 재측정해서 위 값을 얻었다.

================================================================
2. 헤비 유저 안에서의 오프셋 깊이 (A-2 ⑥ 원안 검증)
================================================================

/lab/ratings?userId=36&offset=0&limit=10       0.005573  0.004096  0.004195
/lab/ratings?userId=36&offset=2000&limit=10    0.029834  0.004603  0.004754
/lab/ratings?userId=36&offset=4000&limit=10    0.004719  0.004934  0.005089
/lab/ratings?userId=36&offset=4900&limit=10    0.006866  0.004795  0.004908

관찰: offset 0과 4900이 사실상 같다(4.1ms vs 4.9ms, 1.2배).
(user_id, updated_at DESC) 인덱스가 있어서 유저 안에서는 오프셋이 싸다.
001-plan.md A-2 ⑥의 원안(before: userId=X&offset=4000)은 판정 기준
1.5배에 못 미친다 -> 전체 목록 기준으로 변경함.

================================================================
3. 커서 페이징 + updated_at 인덱스 (A-2 ⑥ 재설계 검증)
================================================================

--- 인덱스 없음 (베이스라인) ---
offset=4900000                              1.252545  1.153295  1.139422
cursorUpdatedAt=2025-01-01T00:00:00Z        0.142217  0.124205  0.163237

--- 커서 깊이별 (인덱스 없음) ---
cursorUpdatedAt=2026-08-01 (얕음)           0.243300  0.258710
cursorUpdatedAt=2025-06-01 (중간)           0.132761  0.160391
cursorUpdatedAt=2024-09-01 (깊음)           0.108667  0.105316

--- CREATE INDEX idx_user_rating__updated ON user_rating(updated_at DESC); ANALYZE; ---
cursorUpdatedAt=2026-08-01 (얕음)           0.007266  0.005587
cursorUpdatedAt=2024-09-01 (깊음)           0.005699  0.005661
offset=4900000                              9.050576  8.201530

관찰:
- 커서는 깊이와 무관하게 평탄하다(인덱스 유무 양쪽 다).
- 인덱스를 걸면 커서는 0.11초 -> 5.7ms (약 20배 개선).
- 같은 인덱스를 걸었는데 오프셋은 1.16초 -> 8.5초로 약 7배 나빠졌다.
  옵티마이저가 Index Scan으로 바꾸면서 4,900,000건을 인덱스로 훑고
  매 건 힙을 찾아가느라 순차 스캔 + top-N sort보다 나빠진 것으로 보인다(가설, EXPLAIN 미확인).

측정 후 DROP INDEX idx_user_rating__updated 로 베이스라인 복귀함.

================================================================
4. 커넥션 풀 크기별 처리량 (pool-size.js 설계 근거)
================================================================

무거운 쿼리 /lab/ratings?offset=4900000&limit=10 를 6건 동시 실행.
풀 크기는 JVM 인자로 덮어씀: -Dspring.datasource.hikari.maximum-pool-size=N
(hikaricp_connections_max 메트릭으로 실제 적용 확인함)

풀  2  (실제 max=2.0)   6건 완료  8.26 s  ->  0.73 TPS
풀 10  (실제 max=10.0)  6건 완료 10.39 s  ->  0.58 TPS
풀 50  (실제 max=50.0)  6건 완료 10.94 s  ->  0.55 TPS

산술 모델 예측 (최대 TPS = 풀 크기 / 쿼리 시간, 쿼리 1.16초 기준)
  풀  2  ->  1.7 TPS   실측은 예측의 43%
  풀 10  ->  8.6 TPS   실측은 예측의  7%
  풀 50  -> 43.1 TPS   실측은 예측의  1%

관찰: 풀을 25배 키웠는데 처리량이 늘지 않고 오히려 약간 줄었다.
DB가 cpus:2 라 CPU가 상한이고, 풀을 키우면 같은 2코어를 더 많은 쿼리가
나눠 쓸 뿐이다. 각 조건 1회 측정이고 차이가 25% 수준이라
"늘지 않는다"는 방향만 취하고 배수는 인용하지 않는다.

--- 무효 측정 (기록만 남김) ---
같은 테스트를 처음 돌렸을 때 세 조건 모두 hikaricp_connections_max=10.0 이었다.
pkill -f 로는 Windows에서 java 프로세스가 안 죽어서 기존 풀 10 앱을 계속
때리고 있었다. 결과도 0.54 / 0.49 / 0.53 TPS 로 사실상 동일했다.
PowerShell Stop-Process 로 포트 8080 점유 프로세스를 죽이도록 바꿔서 재측정함.

================================================================
5. k6 파일럿 — pool-size.js 1차 설계(가벼운 쿼리)는 실패
================================================================

$ k6 run -e POOL=10 -e PROFILE=rehearsal pool-size.js
  (당시 설계: /lab/ratings?userId=36&offset=4000, 워밍업 20rps, 램프 25->50->100)

  █ TOTAL RESULTS

    checks_total.......: 8730    36.374907/s
    checks_succeeded...: 100.00% 8730 out of 8730
    checks_failed......: 0.00%   0 out of 8730

    ✓ status 200

    HTTP
    http_req_duration..............: avg=2.9ms min=520.29µs med=2.95ms max=13.46ms p(90)=3.77ms p(95)=4.06ms
      { expected_response:true }...: avg=2.9ms min=520.29µs med=2.95ms max=13.46ms p(90)=3.77ms p(95)=4.06ms
    http_req_failed................: 0.00%  0 out of 8730
    http_reqs......................: 8730   36.374907/s

    EXECUTION
    dropped_iterations.............: 0      0/s
    iteration_duration.............: avg=3ms   min=520.29µs med=3ms    max=34.26ms p(90)=3.86ms p(95)=4.16ms
    iterations.....................: 8730   36.374907/s
    vus............................: 0      min=0         max=1
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 8.8 MB 37 kB/s
    data_sent......................: 978 kB 4.1 kB/s

  running (4m00.0s), 0000/0100 VUs, 8730 complete and 0 interrupted iterations
  warmup ✓ [ 100% ] 000/050 VUs    1m0s  20.00 iters/s
  ramp   ✓ [ 100% ] 0000/0050 VUs  3m0s  100.00 iters/s

관찰: 100 rps를 다 소화했고 VU 최대가 1개다. 100 rps x 6ms = 동시성 0.6이라
풀 2로도 남아돈다. 동시성이 풀 크기를 넘지 않으면 풀은 변수가 되지 않는다.
-> 무거운 쿼리로 되돌리고 램프를 1->2->4->8 로 재설계함.

================================================================
6. k6 파일럿 — offset-vs-cursor.js 1차 설계도 실패
================================================================

$ k6 run -e MODE=offset -e PROFILE=rehearsal offset-vs-cursor.js
  (당시 설계: 워밍업 3rps, 램프 2->5->10)

  running (0m34.0s), 0054/0104 VUs, 14 complete and 0 interrupted iterations
  warmup   [  57% ] 054/054 VUs  0m34.0s/1m0s  3.00 iters/s
  ramp   • [   0% ] waiting      0m26.0s
  time="2026-08-29T18:43:30+09:00" level=warning msg="Request Failed"
    error="Get \"http://localhost:8080/lab/ratings?offset=4900000&limit=10\": request timeout"

관찰: 워밍업 3 rps에서 이미 VU가 54개까지 쌓이고 30초 타임아웃이 났다.
"단건 1.16초 x 풀 10 = 8 TPS" 계산에 DB CPU가 빠져 있었다.
실측 지속 가능치는 0.55~0.73 TPS다(위 4번).
-> 워밍업 1 rps, 램프 1->2->4->8 로 재설계함. 중단 후 재측정 안 함.

이 실패 자체가 001-plan.md A-1 ②의 "이 계산은 반드시 틀린다"의 실제 사례다.